In [13]:
import pandas as pd
a1 = [1, "송준기", 680]
b1 = [1, "권보아", 880]
c1 = [2, "김나현", 620]
d1 = [2, "송준기", 750]
e1 = [3, "김나현", 750]
f1 = [3, "박효신", 920]
g1 = [3, "진달래", 850]
df1 = pd.DataFrame([a1, a1, b1, c1, d1, e1, f1, g1], columns=["회차", "이름", "점수"])

In [8]:
df1

   회차   이름   점수
0   1  송준기  680
1   1  송준기  680
2   1  권보아  880
3   2  김나현  620
4   2  송준기  750
5   3  김나현  750
6   3  박효신  920
7   3  진달래  850

# 1. 중복값 존재여부 체크

In [7]:
df1.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

# 2. 불리언인덱싱으로 중복값 삭제해보기

In [11]:
df1[~df1.duplicated()]

   회차   이름   점수
0   1  송준기  680
2   1  권보아  880
3   2  김나현  620
4   2  송준기  750
5   3  김나현  750
6   3  박효신  920
7   3  진달래  850

# 3. drop_duplicate함수로 중복값 삭제

In [15]:
df1.drop_duplicates("이름")

   회차   이름   점수
0   1  송준기  680
2   1  권보아  880
3   2  김나현  620
6   3  박효신  920
7   3  진달래  850

# 4. 중복값을 마지막 값만 두고 삭제한다.

In [17]:
df1.drop_duplicates("이름", keep = "last")

   회차   이름   점수
2   1  권보아  880
4   2  송준기  750
5   3  김나현  750
6   3  박효신  920
7   3  진달래  850

# 5. 중복값을 모두 삭제한다.

In [21]:
df1.drop_duplicates("이름", keep = False)

   회차   이름   점수
2   1  권보아  880
6   3  박효신  920
7   3  진달래  850